# -*- coding: utf-8 -*-
"""neo4j_graphs.py

Automatically generated by Colaboratory.

Original file is located at
    https://colab.research.google.com/drive/1itdQ--X-oeL6Jcol3ugTog0E4EuPTCV4
"""

# Setting up envoironment
CREATE CONSTRAINT ON (u:User) ASSERT u.id IS UNIQUE; 
CREATE CONSTRAINT ON (t:Team) ASSERT t.id IS UNIQUE; 
CREATE CONSTRAINT ON (c:TeamChatSession) ASSERT c.id IS UNIQUE; 
CREATE CONSTRAINT ON (i:ChatItem) ASSERT i.id IS UNIQUE;

# imoprting dataset chat_create_team_chat.csv
LOAD CSV FROM "/content/drive/MyDrive/Big Data Management/datasets/chat-data/chat_create_team_chat.csv" AS row 
MERGE (u:User {id: toInteger(row[0])})
MERGE (t:Team {id: toInteger(row[1])}) 
MERGE (c:TeamChatSession {id: toInteger(row[2])}) 
MERGE (u)-[:CreatesSession{timeStamp: row[3]}]->(c) 
MERGE (c)-[:OwnedBy{timeStamp: row[3]}]->(t)

# import chat_join_team_chat.csv
LOAD CSV FROM "/content/drive/MyDrive/Big Data Management/datasets/chat-data/chat_join_team_chat.csv" AS row 
MERGE (u:User {id: toInteger(row[0])})
MERGE (c:TeamChatSession {id: toInteger(row[1])}) 
MERGE (u)-[:Joins{timeStamp: row[2]}]->(c)

# import chat_leave_team_chat.csv
LOAD CSV FROM "/content/drive/MyDrive/Big Data Management/datasets/chat-data/chat_leave_team_chat.csv" AS row 
MERGE (u:User {id: toInteger(row[0])})
MERGE (c:TeamChatSession {id: toInteger(row[1])})   
MERGE (u)-[:Leaves{timeStamp: row[2]}]->(c)

# import chat_item_team_chat.csv
LOAD CSV FROM "/content/drive/MyDrive/Big Data Management/datasets/chat-data/chat_item_team_chat.csv" AS row 
MERGE (u:User {id: toInteger(row[0])})
MERGE (c:TeamChatSession {id: toInteger(row[1])}) 
MERGE (i:ChatItem {id: toInteger(row[2])})
MERGE (u)-[:CreateChat{timeStamp: row[3]}]->(i)
MERGE (i)-[:PartOf{timeStamp: row[3]}]->(c)

#import chat_mention_team_chat.csv
LOAD CSV FROM "/content/drive/MyDrive/Big Data Management/datasets/chat-data/chat_mention_team_chat.csv" AS row
MERGE (i:ChatItem {id: toInteger(row[0])})
MERGE (u:User {id: toInteger(row[1])})
MERGE (i)-[:Mentioned{timestamp: row[2]}]->(u)

# chat_respond_team_chat.csv
LOAD CSV FROM "/content/drive/MyDrive/Big Data Management/datasets/chat-data/chat_respond_team_chat.csv" AS row
MERGE (i1:ChatItem {id: toInteger(row[0])})
MERGE (i2:ChatItem {id: toInteger(row[1])})
MERGE (i2)-[:ResponseTo{timestamp: row[2]}]->(i1)

"""# now setting up the data to produce information about data"""

#number chats involved
MATCH p=()-[:ResponseTo*]->()
RETURN length(p) as length
ORDER BY length DESC
LIMIT 1

# the users participated in chating
MATCH p=(i1:ChatItem)-[:ResponseTo*]->(i2:ChatItem)
WITH max(length(p)) as max_length
MATCH p=(i1:ChatItem)-[:ResponseTo*]->(i2:ChatItem) WHERE length(p) = max_length
WITH [i in nodes(p)] as items
MATCH path=(u:User)-[:CreateChat]->(i:ChatItem)
WHERE i IN items
RETURN DISTINCT path

MATCH p=(i1:ChatItem)-[:ResponseTo*]->(i2:ChatItem) WHERE length(p) = 9 
WITH [i in nodes(p)] as items
MATCH path=(u:User)-[:CreateChat]->(i:ChatItem)
WHERE i IN items
RETURN COUNT(DISTINCT u) AS Participating_Users

"""### figuring out top 10 chatiest users"""

MATCH (u:User)-[c:CreateChat]->()
RETURN u.id as UserID, COUNT(c) as Chats
ORDER BY Chats DESC
LIMIT 10

"""```
╒════════╤═══════╕
│"UserID"│"Chats"│
╞════════╪═══════╡
│394     │115    │
├────────┼───────┤
│2067    │111    │
├────────┼───────┤
│1087    │109    │
├────────┼───────┤
│209     │109    │
├────────┼───────┤
│554     │107    │
├────────┼───────┤
│1627    │105    │
├────────┼───────┤
│516     │105    │
├────────┼───────┤
│999     │105    │
├────────┼───────┤
│668     │104    │
├────────┼───────┤
│461     │104    │
└────────┴───────┘
```

### now figuring out top 10 chateist teams
"""

MATCH (i:ChatItem)-[:PartOf]->(:TeamChatSession)-[:OwnedBy]->(t:Team)
RETURN t.id as TeamID, COUNT(i) as Chats
ORDER BY Chats DESC
LIMIT 10

"""```
╒════════╤═══════╕
│"TeamID"│"Chats"│
╞════════╪═══════╡
│82      │1324   │
├────────┼───────┤
│185     │1036   │
├────────┼───────┤
│112     │957    │
├────────┼───────┤
│18      │844    │
├────────┼───────┤
│194     │836    │
├────────┼───────┤
│129     │814    │
├────────┼───────┤
│52      │788    │
├────────┼───────┤
│136     │783    │
├────────┼───────┤
│146     │746    │
├────────┼───────┤
│81      │736    │
└────────┴───────┘
```
"""

# checking either the any user from chatiest team
MATCH (u:User)-[c:CreateChat]->() 
WITH u, COUNT(c) as UserChats 
ORDER BY UserChats DESC LIMIT 10 
WITH [u.id] as ChattiestUsers

MATCH (u:User)-[:CreateChat]->(:ChatItem)-[:PartOf]->(:TeamChatSession)-[:OwnedBy]->(t:Team)
WHERE u.id IN ChattiestUsers
  AND t.id IN [82,185,112,18,194,129,52,136,146,81]
return DISTINCT u.id AS User, t.id as Team

"""```
╒══════╤══════╕
│"User"│"Team"│
╞══════╪══════╡
│999   │52    │
└──────┴──────┘
```
"""